In [1]:
import pandas as pd

In [3]:
grades_dict = {'Wallly': [87, 96, 70], 'Eva': [100, 87, 90], 'Sam': [94, 77, 90], 'Katie': [100, 81, 82], 'Bob': [83, 65, 85]}

In [4]:
grades = pd.DataFrame(grades_dict)

In [5]:
grades

   Wallly  Eva  Sam  Katie  Bob
0      87  100   94    100   83
1      96   87   77     81   65
2      70   90   90     82   85

In [6]:
#customizing a DataFrame's Indices with the index Attriebute

In [8]:
pd.DataFrame(grades_dict, index=['Test1', 'Test2', 'Test3'])

       Wallly  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test2      96   87   77     81   65
Test3      70   90   90     82   85

In [10]:
grades.index = ['Test1', 'Test2', 'Test3']

In [11]:
grades

       Wallly  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test2      96   87   77     81   65
Test3      70   90   90     82   85

In [12]:
grades['Eva']

Test1    100
Test2     87
Test3     90
Name: Eva, dtype: int64

In [13]:
grades.Sam

Test1    94
Test2    77
Test3    90
Name: Sam, dtype: int64

In [14]:
grades.loc['Test1']

Wallly     87
Eva       100
Sam        94
Katie     100
Bob        83
Name: Test1, dtype: int64

In [15]:
grades.loc['Test2']

Wallly    96
Eva       87
Sam       77
Katie     81
Bob       65
Name: Test2, dtype: int64

In [16]:
grades.loc['Test3']

Wallly    70
Eva       90
Sam       90
Katie     82
Bob       85
Name: Test3, dtype: int64

In [17]:
grades.iloc[1]

Wallly    96
Eva       87
Sam       77
Katie     81
Bob       65
Name: Test2, dtype: int64

In [18]:
grades.loc['Test1':'Test3']

       Wallly  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test2      96   87   77     81   65
Test3      70   90   90     82   85

In [21]:
grades.iloc[0:2]

       Wallly  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test2      96   87   77     81   65

In [22]:
grades.loc[['Test1', 'Test3']]

       Wallly  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test3      70   90   90     82   85

In [23]:
grades.iloc[[0, 2]]

       Wallly  Eva  Sam  Katie  Bob
Test1      87  100   94    100   83
Test3      70   90   90     82   85

In [24]:
grades.loc['Test1':'Test2', ['Eva', 'Katie']]

       Eva  Katie
Test1  100    100
Test2   87     81

In [27]:
grades.iloc[[0, 2], 0:3]

       Wallly  Eva  Sam
Test1      87  100   94
Test3      70   90   90

In [28]:
grades[grades >=90]

       Wallly    Eva   Sam  Katie  Bob
Test1     NaN  100.0  94.0  100.0  NaN
Test2    96.0    NaN   NaN    NaN  NaN
Test3     NaN   90.0  90.0    NaN  NaN

In [30]:
grades[(grades >= 80) & (grades < 90)]

       Wallly   Eva  Sam  Katie   Bob
Test1    87.0   NaN  NaN    NaN  83.0
Test2     NaN  87.0  NaN   81.0   NaN
Test3     NaN   NaN  NaN   82.0  85.0

In [33]:
grades.at['Test2', 'Eva']

87

In [34]:
grades.iat[2, 0]

70

In [35]:
grades.at['Test2', 'Eva'] = 100

In [36]:
grades.at['Test2', 'Eva']

100

In [37]:
grades.iat[1, 2] = 87

In [38]:
grades.iat[1, 2]

87

In [43]:
grades.describe()

          Wallly         Eva        Sam       Katie        Bob
count   3.000000    3.000000   3.000000    3.000000   3.000000
mean   84.333333   96.666667  90.333333   87.666667  77.666667
std    13.203535    5.773503   3.511885   10.692677  11.015141
min    70.000000   90.000000  87.000000   81.000000  65.000000
25%    78.500000   95.000000  88.500000   81.500000  74.000000
50%    87.000000  100.000000  90.000000   82.000000  83.000000
75%    91.500000  100.000000  92.000000   91.000000  84.000000
max    96.000000  100.000000  94.000000  100.000000  85.000000

In [54]:
pd.set_option('precision', 2)

OptionError: 'Pattern matched multiple keys'

In [51]:
pd.set_option('display.precision', 2)

In [52]:
grades.mean()

Wallly    84.33
Eva       96.67
Sam       90.33
Katie     87.67
Bob       77.67
dtype: float64

In [53]:
grades.sort_index(ascending=False)

       Wallly  Eva  Sam  Katie  Bob
Test3      70   90   90     82   85
Test2      96  100   87     81   65
Test1      87  100   94    100   83

In [55]:
grades.sort_index(axis=1)

       Bob  Eva  Katie  Sam  Wallly
Test1   83  100    100   94      87
Test2   65  100     81   87      96
Test3   85   90     82   90      70

In [ ]:
Cameron Landon 9/19/2022 8:31 PM